RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_mcan_regs.h
/*
 * CCE (RW)
 *
 * Configuration Change Enable
 * 0= The CPU has no write access to the protected configuration registers
 * 1= The CPU has write access to the protected configuration registers (while CCCR.INIT = ‘1’)
 */
#define MCAN_CCCR_CCE_MASK (0x2U)
#define MCAN_CCCR_CCE_SHIFT (1U)
#define MCAN_CCCR_CCE_SET(x) (((uint32_t)(x) << MCAN_CCCR_CCE_SHIFT) & MCAN_CCCR_CCE_MASK)
#define MCAN_CCCR_CCE_GET(x) (((uint32_t)(x) & MCAN_CCCR_CCE_MASK) >> MCAN_CCCR_CCE_SHIFT)

/*
 * INIT (RW)
 *
 * Initialization
 * 0= Normal Operation
 * 1= Initialization is started
 */
#define MCAN_CCCR_INIT_MASK (0x1U)
#define MCAN_CCCR_INIT_SHIFT (0U)
#define MCAN_CCCR_INIT_SET(x) (((uint32_t)(x) << MCAN_CCCR_INIT_SHIFT) & MCAN_CCCR_INIT_MASK)
#define MCAN_CCCR_INIT_GET(x) (((uint32_t)(x) & MCAN_CCCR_INIT_MASK) >> MCAN_CCCR_INIT_SHIFT)

/* Bitfield definition for register: NBTP */
/*
 * NSJW (RW)
 *
 * Nominal (Re)Synchronization Jump Width
 * Valid values are 0 to 127. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
 */
#define MCAN_NBTP_NSJW_MASK (0xFE000000UL)
#define MCAN_NBTP_NSJW_SHIFT (25U)
#define MCAN_NBTP_NSJW_SET(x) (((uint32_t)(x) << MCAN_NBTP_NSJW_SHIFT) & MCAN_NBTP_NSJW_MASK)
#define MCAN_NBTP_NSJW_GET(x) (((uint32_t)(x) & MCAN_NBTP_NSJW_MASK) >> MCAN_NBTP_NSJW_SHIFT)

/*
 * NBRP (RW)
 *
 * Nominal Bit Rate Prescaler
 * The value by which the oscillator frequency is divided for generating the bit time quanta. The bit time is built up from a multiple of this quanta. Valid values for the Bit Rate Prescaler are 0 to 511. The actual interpretation by the hardware of this value is
 * such that one more than the value programmed here is used.
 */
#define MCAN_NBTP_NBRP_MASK (0x1FF0000UL)
#define MCAN_NBTP_NBRP_SHIFT (16U)
#define MCAN_NBTP_NBRP_SET(x) (((uint32_t)(x) << MCAN_NBTP_NBRP_SHIFT) & MCAN_NBTP_NBRP_MASK)
#define MCAN_NBTP_NBRP_GET(x) (((uint32_t)(x) & MCAN_NBTP_NBRP_MASK) >> MCAN_NBTP_NBRP_SHIFT)

/*
 * NTSEG1 (RW)
 *
 * Nominal Time segment before sample point
 * Valid values are 1 to 255. The actual interpretation by the hardware of this value is such that one more than the programmed value is used.
 */
#define MCAN_NBTP_NTSEG1_MASK (0xFF00U)
#define MCAN_NBTP_NTSEG1_SHIFT (8U)
#define MCAN_NBTP_NTSEG1_SET(x) (((uint32_t)(x) << MCAN_NBTP_NTSEG1_SHIFT) & MCAN_NBTP_NTSEG1_MASK)
#define MCAN_NBTP_NTSEG1_GET(x) (((uint32_t)(x) & MCAN_NBTP_NTSEG1_MASK) >> MCAN_NBTP_NTSEG1_SHIFT)

/*
 * NTSEG2 (RW)
 *
 * Nominal Time segment after sample point
 * Valid values are 1 to 127. The actual interpretation by the hardware of this value is such that one more than the programmed value is used.
 */
#define MCAN_NBTP_NTSEG2_MASK (0x7FU)
#define MCAN_NBTP_NTSEG2_SHIFT (0U)
#define MCAN_NBTP_NTSEG2_SET(x) (((uint32_t)(x) << MCAN_NBTP_NTSEG2_SHIFT) & MCAN_NBTP_NTSEG2_MASK)
#define MCAN_NBTP_NTSEG2_GET(x) (((uint32_t)(x) & MCAN_NBTP_NTSEG2_MASK) >> MCAN_NBTP_NTSEG2_SHIFT)

/* Bitfield definition for register: TSCC */
/*
 * TCP (RW)
 *
 * Timestamp Counter Prescaler
 * Configures the timestamp and timeout counters time unit in multiples of CAN bit times [1…16]. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
 */
#define MCAN_TSCC_TCP_MASK (0xF0000UL)
#define MCAN_TSCC_TCP_SHIFT (16U)
#define MCAN_TSCC_TCP_SET(x) (((uint32_t)(x) << MCAN_TSCC_TCP_SHIFT) & MCAN_TSCC_TCP_MASK)
#define MCAN_TSCC_TCP_GET(x) (((uint32_t)(x) & MCAN_TSCC_TCP_MASK) >> MCAN_TSCC_TCP_SHIFT)

/*
 * TSS (RW)
 *
 * timestamp Select
 * 00= Timestamp counter value always 0x0000
 * 01= Timestamp counter value incremented according to TCP
 * 10= External timestamp counter value used
 * 11= Same as “00”
 */
#define MCAN_TSCC_TSS_MASK (0x3U)
#define MCAN_TSCC_TSS_SHIFT (0U)
#define MCAN_TSCC_TSS_SET(x) (((uint32_t)(x) << MCAN_TSCC_TSS_SHIFT) & MCAN_TSCC_TSS_MASK)
#define MCAN_TSCC_TSS_GET(x) (((uint32_t)(x) & MCAN_TSCC_TSS_MASK) >> MCAN_TSCC_TSS_SHIFT)

/* Bitfield definition for register: TSCV */
/*
 * TSC (RC)
 *
 * Timestamp Counter
 * The internal/external Timestamp Counter value is captured on start of frame (both Rx and Tx).When TSCC.TSS = “01”, the Timestamp Counter is incremented in multiples of CAN bit times [1…16] depending on the configuration of TSCC.TCP.
 * A wrap around sets interrupt flag IR.TSW. Write access resets the counter to zero. When TSCC.TSS = “10”, TSC reflects the external Timestamp Counter value. A write access has no impact.
 */
#define MCAN_TSCV_TSC_MASK (0xFFFFU)
#define MCAN_TSCV_TSC_SHIFT (0U)
#define MCAN_TSCV_TSC_GET(x) (((uint32_t)(x) & MCAN_TSCV_TSC_MASK) >> MCAN_TSCV_TSC_SHIFT)

/* Bitfield definition for register: TOCC */
/*
 * TOP (RW)
 *
 * Timeout Period
 * Start value of the Timeout Counter (down-counter). Configures the Timeout Period.
 */
#define MCAN_TOCC_TOP_MASK (0xFFFF0000UL)
#define MCAN_TOCC_TOP_SHIFT (16U)
#define MCAN_TOCC_TOP_SET(x) (((uint32_t)(x) << MCAN_TOCC_TOP_SHIFT) & MCAN_TOCC_TOP_MASK)
#define MCAN_TOCC_TOP_GET(x) (((uint32_t)(x) & MCAN_TOCC_TOP_MASK) >> MCAN_TOCC_TOP_SHIFT)

/*
 * TOS (RW)
 *
 * Timeout Select
 * When operating in Continuous mode, a write to TOCV presets the counter to the value configured by TOCC.TOP and continues down-counting.
 * When the Timeout Counter is controlled by one of the FIFOs, an empty FIFO presets the counter to the value configured by TOCC.TOP. Down-counting is started when the first FIFO element is stored.
 * 00= Continuous operation
 * 01= Timeout controlled by Tx Event FIFO
 * 10= Timeout controlled by Rx FIFO 0
 * 11= Timeout controlled by Rx FIFO 1
 */
#define MCAN_TOCC_TOS_MASK (0x6U)
#define MCAN_TOCC_TOS_SHIFT (1U)
#define MCAN_TOCC_TOS_SET(x) (((uint32_t)(x) << MCAN_TOCC_TOS_SHIFT) & MCAN_TOCC_TOS_MASK)
#define MCAN_TOCC_TOS_GET(x) (((uint32_t)(x) & MCAN_TOCC_TOS_MASK) >> MCAN_TOCC_TOS_SHIFT)

/*
 * RP (RW)
 *
 * Enable Timeout Counter
 * 0= Timeout Counter disabled
 * 1= Timeout Counter enabled
 */
#define MCAN_TOCC_RP_MASK (0x1U)
#define MCAN_TOCC_RP_SHIFT (0U)
#define MCAN_TOCC_RP_SET(x) (((uint32_t)(x) << MCAN_TOCC_RP_SHIFT) & MCAN_TOCC_RP_MASK)
#define MCAN_TOCC_RP_GET(x) (((uint32_t)(x) & MCAN_TOCC_RP_MASK) >> MCAN_TOCC_RP_SHIFT)

