RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_mcan_regs.h
/*
 * EP (R)
 *
 * Error Passive
 * 0= The M_CAN is in the Error_Active state. It normally takes part in bus communication and sends an active error flag when an error has been detected
 * 1= The M_CAN is in the Error_Passive state
 */
#define MCAN_PSR_EP_MASK (0x20U)
#define MCAN_PSR_EP_SHIFT (5U)
#define MCAN_PSR_EP_GET(x) (((uint32_t)(x) & MCAN_PSR_EP_MASK) >> MCAN_PSR_EP_SHIFT)

/*
 * ACT (R)
 *
 * Activity
 * Monitors the module’s CAN communication state.
 * 00= Synchronizing - node is synchronizing on CAN communication
 * 01= Idle - node is neither receiver nor transmitter
 * 10= Receiver - node is operating as receiver
 * 11= Transmitter - node is operating as transmitter
 * Note: ACT is set to “00” by a Protocol Exception Event.
 */
#define MCAN_PSR_ACT_MASK (0x18U)
#define MCAN_PSR_ACT_SHIFT (3U)
#define MCAN_PSR_ACT_GET(x) (((uint32_t)(x) & MCAN_PSR_ACT_MASK) >> MCAN_PSR_ACT_SHIFT)

/*
 * LEC (S)
 *
 * Last Error Code
 * The LEC indicates the type of the last error to occur on the CAN bus. This field will be cleared to ‘0’when a message has been transferred (reception or transmission) without error.
 * 0= No Error: No error occurred since LEC has been reset by successful reception or transmission.
 * 1= Stuff Error: More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed.
 * 2= Form Error: A fixed format part of a received frame has the wrong format.
 * 3= AckError: The message transmitted by the M_CAN was not acknowledged by another node.
 * 4= Bit1Error: During the transmission of a message (with the exception of the arbitration field),
 * the device wanted to send a recessive level (bit of logical value ‘1’), but the monitored bus
 * value was dominant.
 * 5= Bit0Error: During the transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device wanted to send a dominant level (data or identifier bit logical value‘0’), but the monitored bus value was recessive.
 *  During Bus_Off recovery this status is set each time a sequence of 11 recessive bits has been monitored. This enables the CPU to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at
 * dominant or continuously disturbed).
 * 6= CRCError: The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match with the CRC calculated from the received data.
 * 7= NoChange: Any read access to the Protocol Status Register re-initializes the LEC to ‘7’. When the LEC shows the value ‘7’, no CAN bus event was detected since the last CPU read access to the Protocol Status Register.
 * Note: When a frame in CAN FD format has reached the data phase with BRS flag set, the next CAN event (error or valid frame) will be shown in DLEC instead of LEC. An error in a fixed stuff bit of a CAN FD CRC sequence will be shown as a Form Error, not Stuff Error.
 * Note: The Bus_Off recovery sequence (see ISO 11898-1:2015) cannot be shortened by setting or resetting CCCR.INIT. If the device goes Bus_Off, it will set CCCR.INIT of its own accord,stopping all bus activities.
 *  Once CCCR.INIT has been cleared by the CPU, the device will then wait for 129 occurrences of Bus Idle (129 * 11 consecutive recessive bits) before resuming normal operation.
 * At the end of the Bus_Off recovery sequence, the Error Management Counters will be reset. During the waiting time after the resetting of CCCR.INIT, each time a sequence of 11 recessive bits has been monitored, a Bit0Error code is written to PSR.LEC,
 * enabling the CPU to readily check up whether the CAN bus is stuck at dominant or continuously disturbed and to monitor the Bus_Off recovery sequence. ECR.REC is used to count these sequences.
 * Note: Byte access: Reading byte 0 will set LEC to “111”, reading bytes 3/2/1 has no impact.
 */
#define MCAN_PSR_LEC_MASK (0x7U)
#define MCAN_PSR_LEC_SHIFT (0U)
#define MCAN_PSR_LEC_GET(x) (((uint32_t)(x) & MCAN_PSR_LEC_MASK) >> MCAN_PSR_LEC_SHIFT)

/* Bitfield definition for register: TDCR */
/*
 * TDCO (RW)
 *
 * Transmitter Delay Compensation SSP Offset
 * Offset value defining the distance between the measured delay from m_can_tx to m_can_rx and the secondary sample point. Valid values are 0 to 127 mtq.
 */
#define MCAN_TDCR_TDCO_MASK (0x7F00U)
#define MCAN_TDCR_TDCO_SHIFT (8U)
#define MCAN_TDCR_TDCO_SET(x) (((uint32_t)(x) << MCAN_TDCR_TDCO_SHIFT) & MCAN_TDCR_TDCO_MASK)
#define MCAN_TDCR_TDCO_GET(x) (((uint32_t)(x) & MCAN_TDCR_TDCO_MASK) >> MCAN_TDCR_TDCO_SHIFT)

/*
 * TDCF (RW)
 *
 * Transmitter Delay Compensation Filter Window Length
 * Defines the minimum value for the SSP position, dominant edges on m_can_rx that would result in an earlier SSP position are ignored for transmitter delay measurement.
 * The feature is enabled when TDCF is configured to a value greater than TDCO. Valid values are 0 to 127 mtq.
 */
#define MCAN_TDCR_TDCF_MASK (0x7FU)
#define MCAN_TDCR_TDCF_SHIFT (0U)
#define MCAN_TDCR_TDCF_SET(x) (((uint32_t)(x) << MCAN_TDCR_TDCF_SHIFT) & MCAN_TDCR_TDCF_MASK)
#define MCAN_TDCR_TDCF_GET(x) (((uint32_t)(x) & MCAN_TDCR_TDCF_MASK) >> MCAN_TDCR_TDCF_SHIFT)

/* Bitfield definition for register: IR */
/*
 * ARA (RW)
 *
 * Access to Reserved Address
 * 0= No access to reserved address occurred
 * 1= Access to reserved address occurred
 */
#define MCAN_IR_ARA_MASK (0x20000000UL)
#define MCAN_IR_ARA_SHIFT (29U)
#define MCAN_IR_ARA_SET(x) (((uint32_t)(x) << MCAN_IR_ARA_SHIFT) & MCAN_IR_ARA_MASK)
#define MCAN_IR_ARA_GET(x) (((uint32_t)(x) & MCAN_IR_ARA_MASK) >> MCAN_IR_ARA_SHIFT)

/*
 * PED (RW)
 *
 * Protocol Error in Data Phase (Data Bit Time is used)
 * 0= No protocol error in data phase
 * 1= Protocol error in data phase detected (PSR.DLEC ≠ 0,7)
 */
#define MCAN_IR_PED_MASK (0x10000000UL)
#define MCAN_IR_PED_SHIFT (28U)
#define MCAN_IR_PED_SET(x) (((uint32_t)(x) << MCAN_IR_PED_SHIFT) & MCAN_IR_PED_MASK)
#define MCAN_IR_PED_GET(x) (((uint32_t)(x) & MCAN_IR_PED_MASK) >> MCAN_IR_PED_SHIFT)

/*
 * PEA (RW)
 *
 * Protocol Error in Arbitration Phase (Nominal Bit Time is used)
 * 0= No protocol error in arbitration phase
 * 1= Protocol error in arbitration phase detected (PSR.LEC ≠ 0,7)
 */
#define MCAN_IR_PEA_MASK (0x8000000UL)
#define MCAN_IR_PEA_SHIFT (27U)
#define MCAN_IR_PEA_SET(x) (((uint32_t)(x) << MCAN_IR_PEA_SHIFT) & MCAN_IR_PEA_MASK)
#define MCAN_IR_PEA_GET(x) (((uint32_t)(x) & MCAN_IR_PEA_MASK) >> MCAN_IR_PEA_SHIFT)

