RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_mcan_regs.h
/*
 * TOOL (RW)
 *
 * Timeout Occurred Interrupt Line
 */
#define MCAN_ILS_TOOL_MASK (0x40000UL)
#define MCAN_ILS_TOOL_SHIFT (18U)
#define MCAN_ILS_TOOL_SET(x) (((uint32_t)(x) << MCAN_ILS_TOOL_SHIFT) & MCAN_ILS_TOOL_MASK)
#define MCAN_ILS_TOOL_GET(x) (((uint32_t)(x) & MCAN_ILS_TOOL_MASK) >> MCAN_ILS_TOOL_SHIFT)

/*
 * MRAFL (RW)
 *
 * Message RAM Access Failure Interrupt Line
 */
#define MCAN_ILS_MRAFL_MASK (0x20000UL)
#define MCAN_ILS_MRAFL_SHIFT (17U)
#define MCAN_ILS_MRAFL_SET(x) (((uint32_t)(x) << MCAN_ILS_MRAFL_SHIFT) & MCAN_ILS_MRAFL_MASK)
#define MCAN_ILS_MRAFL_GET(x) (((uint32_t)(x) & MCAN_ILS_MRAFL_MASK) >> MCAN_ILS_MRAFL_SHIFT)

/*
 * TSWL (RW)
 *
 * Timestamp Wraparound Interrupt Line
 */
#define MCAN_ILS_TSWL_MASK (0x10000UL)
#define MCAN_ILS_TSWL_SHIFT (16U)
#define MCAN_ILS_TSWL_SET(x) (((uint32_t)(x) << MCAN_ILS_TSWL_SHIFT) & MCAN_ILS_TSWL_MASK)
#define MCAN_ILS_TSWL_GET(x) (((uint32_t)(x) & MCAN_ILS_TSWL_MASK) >> MCAN_ILS_TSWL_SHIFT)

/*
 * TEFLL (RW)
 *
 * Tx Event FIFO Event Lost Interrupt Line
 */
#define MCAN_ILS_TEFLL_MASK (0x8000U)
#define MCAN_ILS_TEFLL_SHIFT (15U)
#define MCAN_ILS_TEFLL_SET(x) (((uint32_t)(x) << MCAN_ILS_TEFLL_SHIFT) & MCAN_ILS_TEFLL_MASK)
#define MCAN_ILS_TEFLL_GET(x) (((uint32_t)(x) & MCAN_ILS_TEFLL_MASK) >> MCAN_ILS_TEFLL_SHIFT)

/*
 * TEFFL (RW)
 *
 * Tx Event FIFO Full Interrupt Line
 */
#define MCAN_ILS_TEFFL_MASK (0x4000U)
#define MCAN_ILS_TEFFL_SHIFT (14U)
#define MCAN_ILS_TEFFL_SET(x) (((uint32_t)(x) << MCAN_ILS_TEFFL_SHIFT) & MCAN_ILS_TEFFL_MASK)
#define MCAN_ILS_TEFFL_GET(x) (((uint32_t)(x) & MCAN_ILS_TEFFL_MASK) >> MCAN_ILS_TEFFL_SHIFT)

/*
 * TEFWL (RW)
 *
 * Tx Event FIFO Watermark Reached Interrupt Line
 */
#define MCAN_ILS_TEFWL_MASK (0x2000U)
#define MCAN_ILS_TEFWL_SHIFT (13U)
#define MCAN_ILS_TEFWL_SET(x) (((uint32_t)(x) << MCAN_ILS_TEFWL_SHIFT) & MCAN_ILS_TEFWL_MASK)
#define MCAN_ILS_TEFWL_GET(x) (((uint32_t)(x) & MCAN_ILS_TEFWL_MASK) >> MCAN_ILS_TEFWL_SHIFT)

/*
 * TEFNL (RW)
 *
 * Tx Event FIFO New Entry Interrupt Line
 */
#define MCAN_ILS_TEFNL_MASK (0x1000U)
#define MCAN_ILS_TEFNL_SHIFT (12U)
#define MCAN_ILS_TEFNL_SET(x) (((uint32_t)(x) << MCAN_ILS_TEFNL_SHIFT) & MCAN_ILS_TEFNL_MASK)
#define MCAN_ILS_TEFNL_GET(x) (((uint32_t)(x) & MCAN_ILS_TEFNL_MASK) >> MCAN_ILS_TEFNL_SHIFT)

/*
 * TFEL (RW)
 *
 * Tx FIFO Empty Interrupt Line
 */
#define MCAN_ILS_TFEL_MASK (0x800U)
#define MCAN_ILS_TFEL_SHIFT (11U)
#define MCAN_ILS_TFEL_SET(x) (((uint32_t)(x) << MCAN_ILS_TFEL_SHIFT) & MCAN_ILS_TFEL_MASK)
#define MCAN_ILS_TFEL_GET(x) (((uint32_t)(x) & MCAN_ILS_TFEL_MASK) >> MCAN_ILS_TFEL_SHIFT)

/*
 * TCFL (RW)
 *
 * Transmission Cancellation Finished Interrupt Line
 */
#define MCAN_ILS_TCFL_MASK (0x400U)
#define MCAN_ILS_TCFL_SHIFT (10U)
#define MCAN_ILS_TCFL_SET(x) (((uint32_t)(x) << MCAN_ILS_TCFL_SHIFT) & MCAN_ILS_TCFL_MASK)
#define MCAN_ILS_TCFL_GET(x) (((uint32_t)(x) & MCAN_ILS_TCFL_MASK) >> MCAN_ILS_TCFL_SHIFT)

/*
 * TCL (RW)
 *
 * Transmission Completed Interrupt Line
 */
#define MCAN_ILS_TCL_MASK (0x200U)
#define MCAN_ILS_TCL_SHIFT (9U)
#define MCAN_ILS_TCL_SET(x) (((uint32_t)(x) << MCAN_ILS_TCL_SHIFT) & MCAN_ILS_TCL_MASK)
#define MCAN_ILS_TCL_GET(x) (((uint32_t)(x) & MCAN_ILS_TCL_MASK) >> MCAN_ILS_TCL_SHIFT)

/*
 * HPML (RW)
 *
 * High Priority Message Interrupt Line
 */
#define MCAN_ILS_HPML_MASK (0x100U)
#define MCAN_ILS_HPML_SHIFT (8U)
#define MCAN_ILS_HPML_SET(x) (((uint32_t)(x) << MCAN_ILS_HPML_SHIFT) & MCAN_ILS_HPML_MASK)
#define MCAN_ILS_HPML_GET(x) (((uint32_t)(x) & MCAN_ILS_HPML_MASK) >> MCAN_ILS_HPML_SHIFT)

/*
 * RF1LL (RW)
 *
 * Rx FIFO 1 Message Lost Interrupt Line
 */
#define MCAN_ILS_RF1LL_MASK (0x80U)
#define MCAN_ILS_RF1LL_SHIFT (7U)
#define MCAN_ILS_RF1LL_SET(x) (((uint32_t)(x) << MCAN_ILS_RF1LL_SHIFT) & MCAN_ILS_RF1LL_MASK)
#define MCAN_ILS_RF1LL_GET(x) (((uint32_t)(x) & MCAN_ILS_RF1LL_MASK) >> MCAN_ILS_RF1LL_SHIFT)

/*
 * RF1FL (RW)
 *
 * Rx FIFO 1 Full Interrupt Line
 */
#define MCAN_ILS_RF1FL_MASK (0x40U)
#define MCAN_ILS_RF1FL_SHIFT (6U)
#define MCAN_ILS_RF1FL_SET(x) (((uint32_t)(x) << MCAN_ILS_RF1FL_SHIFT) & MCAN_ILS_RF1FL_MASK)
#define MCAN_ILS_RF1FL_GET(x) (((uint32_t)(x) & MCAN_ILS_RF1FL_MASK) >> MCAN_ILS_RF1FL_SHIFT)

/*
 * RF1WL (RW)
 *
 * Rx FIFO 1 Watermark Reached Interrupt Line
 */
#define MCAN_ILS_RF1WL_MASK (0x20U)
#define MCAN_ILS_RF1WL_SHIFT (5U)
#define MCAN_ILS_RF1WL_SET(x) (((uint32_t)(x) << MCAN_ILS_RF1WL_SHIFT) & MCAN_ILS_RF1WL_MASK)
#define MCAN_ILS_RF1WL_GET(x) (((uint32_t)(x) & MCAN_ILS_RF1WL_MASK) >> MCAN_ILS_RF1WL_SHIFT)

/*
 * RF1NL (RW)
 *
 * Rx FIFO 1 New Message Interrupt Line
 */
#define MCAN_ILS_RF1NL_MASK (0x10U)
#define MCAN_ILS_RF1NL_SHIFT (4U)
#define MCAN_ILS_RF1NL_SET(x) (((uint32_t)(x) << MCAN_ILS_RF1NL_SHIFT) & MCAN_ILS_RF1NL_MASK)
#define MCAN_ILS_RF1NL_GET(x) (((uint32_t)(x) & MCAN_ILS_RF1NL_MASK) >> MCAN_ILS_RF1NL_SHIFT)

/*
 * RF0LL (RW)
 *
 * Rx FIFO 0 Message Lost Interrupt Line
 */
#define MCAN_ILS_RF0LL_MASK (0x8U)
#define MCAN_ILS_RF0LL_SHIFT (3U)
#define MCAN_ILS_RF0LL_SET(x) (((uint32_t)(x) << MCAN_ILS_RF0LL_SHIFT) & MCAN_ILS_RF0LL_MASK)
#define MCAN_ILS_RF0LL_GET(x) (((uint32_t)(x) & MCAN_ILS_RF0LL_MASK) >> MCAN_ILS_RF0LL_SHIFT)

/*
 * RF0FL (RW)
 *
 * Rx FIFO 0 Full Interrupt Line
 */
#define MCAN_ILS_RF0FL_MASK (0x4U)
#define MCAN_ILS_RF0FL_SHIFT (2U)
#define MCAN_ILS_RF0FL_SET(x) (((uint32_t)(x) << MCAN_ILS_RF0FL_SHIFT) & MCAN_ILS_RF0FL_MASK)
#define MCAN_ILS_RF0FL_GET(x) (((uint32_t)(x) & MCAN_ILS_RF0FL_MASK) >> MCAN_ILS_RF0FL_SHIFT)

/*
 * RF0WL (RW)
 *
 * Rx FIFO 0 Watermark Reached Interrupt Line
 */
#define MCAN_ILS_RF0WL_MASK (0x2U)
#define MCAN_ILS_RF0WL_SHIFT (1U)
#define MCAN_ILS_RF0WL_SET(x) (((uint32_t)(x) << MCAN_ILS_RF0WL_SHIFT) & MCAN_ILS_RF0WL_MASK)
#define MCAN_ILS_RF0WL_GET(x) (((uint32_t)(x) & MCAN_ILS_RF0WL_MASK) >> MCAN_ILS_RF0WL_SHIFT)

/*
 * RF0NL (RW)
 *
 * Rx FIFO 0 New Message Interrupt Line
 */
#define MCAN_ILS_RF0NL_MASK (0x1U)
#define MCAN_ILS_RF0NL_SHIFT (0U)
#define MCAN_ILS_RF0NL_SET(x) (((uint32_t)(x) << MCAN_ILS_RF0NL_SHIFT) & MCAN_ILS_RF0NL_MASK)
#define MCAN_ILS_RF0NL_GET(x) (((uint32_t)(x) & MCAN_ILS_RF0NL_MASK) >> MCAN_ILS_RF0NL_SHIFT)

